# Ultralytics YOLOv8-OBB - NPU Multi-Scale Master Template
# =========================================================
# 🎛️ 规模控制台：请保留你需要的那组配置，将其余组注释掉（加 #）
# ⚠️ 警告：同一时间只能有一组 npu_channels 处于非注释状态！
# =========================================================

# 🟢 方案 A: 极限版 (目标 RKNN 300KB, 约 2# 6万参数)
#npu_cha# nnels:
#  C1 : &C1 16
#  C2 : &C2 16
#  C3 : &C3 32
#  C4 : &C4 48
#  C5 : &C5 64

# 🔵 方案 B: 50万参数版 (约 48万参数, RKNN 约 600KB)
# npu_channels:
#  C1: &C1 16
#  C2: &C2 32
#  C3: &C3 48
#  C4: &C4 64
#  C5: &C5 96

# 🟡 方案 C: 100万参数版 (约 105万参数, RKNN 约 1.2MB)
# npu_channels:
# C1: &C1 16
# C2: &C2 32
# C3: &C3 64
# C4: &C4 96
# C5: &C5 160

# 🟠 方案 D: 150万参数版 (约 150万参数, RKNN 约 1.6MB)
# npu_channels:
# C1: &C1 16
# C2: &C2 32
# C3: &C3 64
# C4: &C4 128
# C5: &C5 192

# 🔴 方案 E: 200万参数版 (约 195万参数, RKNN 约 2.1MB)
#npu_channels:
  # C1: &C1 16
   # C2: &C2 32
   # C3: &C3 64
   # C4: &C4 128
   # C5: &C5 256

# 🟣 方案 F: 250万参数版 (约 250万参数, 高分辨率偏置)
#npu_channels:
  # C1: &C1 24
   # C2: &C2 48
   # C3: &C3 96
   # C4: &C4 160
# C5: &C5 224

#🟤 方案 G: 300数版 (约 300万参数高分辨率偏置)
npu_channels:
 C1: &C1 32
 C2: &C2 64
 C3: &C3 128
 C4: &C4 192
 C5: &C5 256

# =========================================================
# 👇 网络架构定义区
# =========================================================

nc: 15
ch: 1  # 强制单通道灰度图输入
hyp:
  box: 7.5
  cls: 0.5
  dfl: 1.5
  angle: 5.0  # 新增角度损失权重


scales:
  # 【已修复】：强制系数为 1.0，关闭系统的自动缩放，保证通道严格对齐！
  n: [1.0, 1.0, 1024]

backbone:
  - [-1, 1, Conv, [*C1, 3, 2]]       # 0-P1/2
  - [-1, 1, GhostConv, [*C2, 3, 2]]  # 1-P2/4
  - [-1, 1, C3Ghost, [*C2, True]]    # 2 

  - [-1, 1, GhostConv, [*C3, 3, 2]]  # 3-P3/8
  - [-1, 1, C3Ghost, [*C3, True]]    # 4 

  - [-1, 1, GhostConv, [*C4, 3, 2]]  # 5-P4/16
  - [-1, 2, C3Ghost, [*C4, True]]    # 6 

  - [-1, 1, GhostConv, [*C5, 3, 2]]  # 7-P5/32
  - [-1, 1, C3Ghost, [*C5, True]]    # 8 

  # 替换 PSA 为 SPPF，RV1106 硬件原生支持其内部的 MaxPool 算子
  - [-1, 1, SPPF, [*C5, 5]]          # 9: P5 空间金字塔池化

head:
  # --- 自顶向下融合 (Top-down) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]]        # 11: 拼接 P4
  - [-1, 1, C3Ghost, [*C4, False]]   # 12: 融合 P4 特征 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]]        # 14: 拼接 P3
  - [-1, 1, C3Ghost, [*C3, False]]   # 15: P3 最终特征输出 【输出头 1】

  # --- 自底向上融合 (Bottom-up) ---
  - [-1, 1, GhostConv, [*C3, 3, 2]]  # 16: P3 下采样回 P4
  - [[-1, 12], 1, Concat, [1]]       # 17: 拼接 上方的 P4 融合特征
  - [-1, 1, C3Ghost, [*C4, False]]   # 18: P4 最终特征输出 【输出头 2】 

  - [-1, 1, GhostConv, [*C4, 3, 2]]  # 19: P4 下采样回 P5
  - [[-1, 9], 1, Concat, [1]]        # 20: 拼接 SPPF 输出的 P5
  - [-1, 1, C3Ghost, [*C5, False]]   # 21: P5 最终特征输出 【输出头 3】 

  # --- 官方标准 OBB 检测头 ---
  # 层级索引已精准更新为 [15, 18, 21]
  - [[15, 18, 21], 1, OBB, [15, 1]]  # 22: 强制写入 15 个类别
