# =========================================================
# Ultralytics YOLOv8-OBB - VanillaNet + C2f_SE (5阶全量配置表)
# Features: 纯直筒主干部署折叠 + SE注意力颈部
# 🎯 目标参数量: 30w(极速), 45w, 70w, 100w, 150w, 200w
# =========================================================

# 🎛️ 规模控制台：请保留你需要测试的那组配置，将其余组注释掉

# 🟢 方案 1: ~30w 参数版 (已验证: 29.6w) - 适用 130+ FPS 极限流
npu_channels:
  C1: &C1 8
  C2: &C2 16
  C3: &C3 32
  C4: &C4 64

# 🔵 方案 2: ~45w 参数版 - 适用 ~100 FPS 工业甜点区
# npu_channels:
#   C1: &C1 16
#   C2: &C2 24
#   C3: &C3 48
#   C4: &C4 80

# 🟡 方案 3: ~70w 参数版 (已验证: 67.5w) - 适用 ~80 FPS 高平衡区
# npu_channels:
#   C1: &C1 16
#   C2: &C2 32
#   C3: &C3 64
#   C4: &C4 128

# 🟠 方案 4: ~100w 参数版 - 适用 ~60 FPS 常规识别
# npu_channels:
#   C1: &C1 24
#   C2: &C2 48
#   C3: &C3 80
#   C4: &C4 160

# 🔴 方案 5: ~150w 参数版 - 适用 ~45 FPS 复杂场景
# npu_channels:
#   C1: &C1 24
#   C2: &C2 48
#   C3: &C3 96
#   C4: &C4 240

# 🟣 方案 6: ~200w 参数版 - 适用 ~35 FPS 高精度大模型
# npu_channels:
#   C1: &C1 32
#   C2: &C2 64
#   C3: &C3 112
#   C4: &C4 256

# =========================================================
# 👇 网络架构定义区 (无需更改)
# =========================================================
nc: 15
ch: 3  # 顺应 DataLoader 避免维度崩溃

scales:
  n: [1.0, 1.0, 1024] 

backbone:
  - [-1, 1, Conv, [*C1, 4, 4]]               # 0-P2/4
  - [-1, 1, vanillanetBlock, [*C2, 1, 2]]    # 1-P3/8
  - [-1, 1, vanillanetBlock, [*C3, 1, 2]]    # 2-P4/16
  - [-1, 1, vanillanetBlock, [*C4, 1, 2]]    # 3-P5/32
  - [-1, 1, SPPF, [*C4, 5]]                  # 4

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, C2f_SE, [*C3, False, 1, 1]]      # 7

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 1, C2f_SE, [*C2, False, 1, 1]]      # 10 (P3/8-small)

  - [-1, 1, Conv, [*C2, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 1, C2f_SE, [*C3, False, 1, 1]]      # 13 (P4/16-medium)

  - [-1, 1, Conv, [*C3, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2f_SE, [*C4, False, 1, 1]]      # 16 (P5/32-large)

  - [[10, 13, 16], 1, OBB, [nc, 1]]          # 17: Detect(P3, P4, P5)
