# QG-OBB stage-1 config: RV1106-M2 backbone with unit-cycle angle branch.
# The only structural change from yolov8n_obb_rv1106_m2.yaml is OBB ne=2:
# angle head outputs [sin(2theta), cos(2theta)] instead of scalar theta.

nc: 15
ch: 1

npu_channels:
  C1: &C1 16
  C2: &C2 40
  C3: &C3 80
  C4: &C4 144
  C5: &C5 208

scales:
  n: [1.0, 1.0, 1024]

backbone:
  - [-1, 1, Conv, [*C1, 3, 2]]
  - [-1, 1, SCDown, [*C2, 3, 2]]
  - [-1, 1, C2fCIB, [*C2, True, False]]

  - [-1, 1, SCDown, [*C3, 3, 2]]
  - [-1, 2, C2fCIB, [*C3, True, False]]

  - [-1, 1, SCDown, [*C4, 3, 2]]
  - [-1, 2, C2fCIB, [*C4, True, False]]

  - [-1, 1, SCDown, [*C5, 3, 2]]
  - [-1, 1, C2fCIB, [*C5, True, True]]

  - [-1, 1, SPPF, [*C5, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2fCIB, [*C4, False, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2fCIB, [*C3, False, False]]

  - [-1, 1, SCDown, [*C3, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C2fCIB, [*C4, False, False]]

  - [-1, 1, SCDown, [*C4, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C2fCIB, [*C5, False, True]]

  - [[15, 18, 21], 1, OBB, [15, 2]]
